Revit 2024 API
FabricArea Class
 An object that represents an Fabric Area Distribution within the Autodesk Revit project. It is container for Fabric Sheet elements.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class FabricArea : Element
Visual Basic
Public Class FabricArea _
	Inherits Element
Visual C++
public ref class FabricArea : public Element
Remarks
 This object derived from the Element base object and such supports all the methods of that object such as the ability to retrieve the parameters of that object. The Fabric Area element is available only in the Autodesk Revit Structure product.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.FabricArea
See Also
FabricArea Members
Autodesk.Revit.DB.Structure Namespace